In [1]:
import pandas as pd

df = pd.DataFrame([{'Name': 'Chris', 'Item Purchased': 'Sponge', 'Cost': 22.50},
                   {'Name': 'Kevyn', 'Item Purchased': 'Kitty Litter', 'Cost': 2.50},
                   {'Name': 'Filip', 'Item Purchased': 'Spoon', 'Cost': 5.00}],
                  index=['Store 1', 'Store 1', 'Store 2'])
df

         Cost Item Purchased   Name
Store 1  22.5         Sponge  Chris
Store 1   2.5   Kitty Litter  Kevyn
Store 2   5.0          Spoon  Filip

In [2]:
staff_df = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR'},
                         {'Name': 'Sally', 'Role': 'Course liasion'},
                         {'Name': 'James', 'Role': 'Grader'}])
staff_df = staff_df.set_index('Name')
student_df = pd.DataFrame([{'Name': 'James', 'School': 'Business'},
                           {'Name': 'Mike', 'School': 'Law'},
                           {'Name': 'Sally', 'School': 'Engineering'}])
student_df = student_df.set_index('Name')
print(staff_df.head())
print()
print(student_df.head())

                 Role
Name
Kelly  Director of HR
Sally  Course liasion
James          Grader
()
            School
Name
James     Business
Mike           Law
Sally  Engineering

In [3]:
staff_df

                 Role
Name
Kelly  Director of HR
Sally  Course liasion
James          Grader

In [4]:
student_df

            School
Name
James     Business
Mike           Law
Sally  Engineering

In [5]:
pd.merge(staff_df,student_df,how='inner',left_index=True,right_index=True)

                 Role       School
Name
James          Grader     Business
Sally  Course liasion  Engineering

In [7]:
pd.merge(staff_df,student_df,how='outer',left_index=True,right_index=True)

                 Role       School
Name
James          Grader     Business
Kelly  Director of HR          NaN
Mike              NaN          Law
Sally  Course liasion  Engineering

In [10]:
pd.merge(student_df,staff_df,how='inner',left_index=True,right_index=True)

            School            Role
Name
Sally  Engineering  Course liasion
James     Business          Grader

In [11]:
pd.merge(student_df,staff_df,how='left',left_index=True,right_index=True)

            School            Role
Name
James     Business          Grader
Mike           Law             NaN
Sally  Engineering  Course liasion

In [12]:
pd.merge(student_df,staff_df,how='right',left_index=True,right_index=True)

            School            Role
Name
Kelly          NaN  Director of HR
Sally  Engineering  Course liasion
James     Business          Grader

In [15]:
p1=['a','a','b','b','c']
p2=[3,4,4,5,6]
df1=pd.DataFrame({'Name':p1,'value':p2})

In [16]:
df1

  Name  value
0    a      3
1    a      4
2    b      4
3    b      5
4    c      6

In [20]:
df2=pd.DataFrame({'person':['a','b','c','d'],'origin':['star','central','naional','league']})

In [21]:
df2

    origin person
0     star      a
1  central      b
2  naional      c
3   league      d

In [22]:
pd.merge(df1,df2,how='inner',left_on='Name',right_on='person')

  Name  value   origin person
0    a      3     star      a
1    a      4     star      a
2    b      4  central      b
3    b      5  central      b
4    c      6  naional      c

In [24]:
pd.merge(df1,df2,how='outer',left_on='Name',right_on='person')

  Name  value   origin person
0    a    3.0     star      a
1    a    4.0     star      a
2    b    4.0  central      b
3    b    5.0  central      b
4    c    6.0  naional      c
5  NaN    NaN   league      d

In [25]:
pd.merge(df1,df2,how='left',left_on='Name',right_on='person')

  Name  value   origin person
0    a      3     star      a
1    a      4     star      a
2    b      4  central      b
3    b      5  central      b
4    c      6  naional      c

In [26]:
pd.merge(df1,df2,how='right',left_on='Name',right_on='person')

  Name  value   origin person
0    a    3.0     star      a
1    a    4.0     star      a
2    b    4.0  central      b
3    b    5.0  central      b
4    c    6.0  naional      c
5  NaN    NaN   league      d

In [27]:
staff_df = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR', 'Location': 'State Street'},
                         {'Name': 'Sally', 'Role': 'Course liasion', 'Location': 'Washington Avenue'},
                         {'Name': 'James', 'Role': 'Grader', 'Location': 'Washington Avenue'}])
student_df = pd.DataFrame([{'Name': 'James', 'School': 'Business', 'Location': '1024 Billiard Avenue'},
                           {'Name': 'Mike', 'School': 'Law', 'Location': 'Fraternity House #22'},
                           {'Name': 'Sally', 'School': 'Engineering', 'Location': '512 Wilson Crescent'}])
pd.merge(staff_df, student_df, how='left', left_on='Name', right_on='Name')

          Location_x   Name            Role            Location_y       School
0       State Street  Kelly  Director of HR                   NaN          NaN
1  Washington Avenue  Sally  Course liasion   512 Wilson Crescent  Engineering
2  Washington Avenue  James          Grader  1024 Billiard Avenue     Business

In [28]:
staff_df

            Location   Name            Role
0       State Street  Kelly  Director of HR
1  Washington Avenue  Sally  Course liasion
2  Washington Avenue  James          Grader

In [29]:
student_df

               Location   Name       School
0  1024 Billiard Avenue  James     Business
1  Fraternity House #22   Mike          Law
2   512 Wilson Crescent  Sally  Engineering

In [30]:
staff_df = pd.DataFrame([{'First Name': 'Kelly', 'Last Name': 'Desjardins', 'Role': 'Director of HR'},
                         {'First Name': 'Sally', 'Last Name': 'Brooks', 'Role': 'Course liasion'},
                         {'First Name': 'James', 'Last Name': 'Wilde', 'Role': 'Grader'}])
student_df = pd.DataFrame([{'First Name': 'James', 'Last Name': 'Hammond', 'School': 'Business'},
                           {'First Name': 'Mike', 'Last Name': 'Smith', 'School': 'Law'},
                           {'First Name': 'Sally', 'Last Name': 'Brooks', 'School': 'Engineering'}])
staff_df
student_df
pd.merge(staff_df, student_df, how='inner', left_on=['First Name','Last Name'], right_on=['First Name','Last Name'])

  First Name Last Name            Role       School
0      Sally    Brooks  Course liasion  Engineering

In [31]:
staff_df

  First Name   Last Name            Role
0      Kelly  Desjardins  Director of HR
1      Sally      Brooks  Course liasion
2      James       Wilde          Grader

In [32]:
student_df

  First Name Last Name       School
0      James   Hammond     Business
1       Mike     Smith          Law
2      Sally    Brooks  Engineering

In [33]:
pd.merge(staff_df,student_df,how='inner',left_on=['First Name','Last Name'],right_on=['First Name','Last Name'])

  First Name Last Name            Role       School
0      Sally    Brooks  Course liasion  Engineering

In [34]:
pd.merge(staff_df,student_df,how='outer',left_on=['First Name','Last Name'],right_on=['First Name','Last Name'])

  First Name   Last Name            Role       School
0      Kelly  Desjardins  Director of HR          NaN
1      Sally      Brooks  Course liasion  Engineering
2      James       Wilde          Grader          NaN
3      James     Hammond             NaN     Business
4       Mike       Smith             NaN          Law

In [35]:
pd.merge(staff_df,student_df,how='left',left_on=['First Name','Last Name'],right_on=['First Name','Last Name'])

  First Name   Last Name            Role       School
0      Kelly  Desjardins  Director of HR          NaN
1      Sally      Brooks  Course liasion  Engineering
2      James       Wilde          Grader          NaN